app/Controllers/Admin/Tahunajaran.php

  public function hapus(string $id)
  {
    if (!session()->isadmin) {
      $msg = [
        'status' => false,
        'url' => site_url("admin/login"),
        'pesan'     => 'Anda tidak berhak mengakses halaman ini',
      ];
      return json_encode($msg);
    }

    $hapus = $this->tahunajaran->update(['id_tahun', $id], ['isDelete' => 1]);
---
UPDATE `tbl_tahunajaran` SET `isDelete` = 1
WHERE `tbl_tahunajaran`.`id_tahun` IN ('id_tahun','3')