app/Models/TahunajaranModel.php

  public function find_active()
  {
    return $this->db->table($this->table)
      ->where('isDelete', null)
      ->orderBy('tahun_ajaran', 'DESC')
      ->get()
      ->getResultArray();
---
SELECT *
FROM `tbl_tahunajaran`
WHERE `isDelete` IS NULL
ORDER BY `tahun_ajaran` DESC